# Customer Shared - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
./src/customer/shared/infrastructure/workspaces/production relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/Connectilly/Connectilly/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/Connectilly/Connectilly

To view this run in a browser, visit:
https://app.terraform.io/app/connectilly/production-customer/runs/run-tAnZeYAzY3jaPha7

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
module.database.cockroach_cluster.default: Refreshing state... [id=566244b2-83f9-44aa-9bc1-c68eb2d2ea79]
module.database.cockroach_database.default: Refreshing state... [id=566244b2-83f9-44aa-9bc1-c68eb2d2ea79:customer]
module.database.aws_ssm_parameter.default: Refreshing state... [id=production-customer-database-cluster-id]
module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refreshing...
module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.database_migration_user.data.aws_ssm_parameter.cluster_id: Refresh complete after 0s [id=production-customer-database-cluster-id]
module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=566244b2-83f9-44aa-9bc1-c68eb2d2ea79:database-migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "customer"
      + id                = "566244b2-83f9-44aa-9bc1-c68eb2d2ea79"
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "database-migration"
    }

  # module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "566244b2-83f9-44aa-9bc1-c68eb2d2ea79:database-migration"
        name       = "database-migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "591682f6-f006-4450-9366-b5f87f2b8e69" -> "043dceff-8e26-4e1e-9b0d-ee3b80966480"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*